       IDENTIFICATION DIVISION.
	   PROGRAM-ID. CIRCLE_AREA.
	   AUTHOR. FABIO.
		
       ENVIRONMENT DIVISION.
	   CONFIGURATION SECTION.
	   SOURCE-COMPUTER. 
	   OBJECT-COMPUTER.
	   
       INPUT-OUTPUT SECTION.
	   FILE-CONTROL.
			             
               
       DATA DIVISION.
       FILE SECTION.
	  
	   WORKING-STORAGE SECTION.
	   
	   01 WS-PI-VALUE  PIC 9V99999 VALUE 3.14159.
			
	   01 WS-RADIUS    PIC 9(5) VALUE 0.
	   01 WS-CIRC	   PIC 9(8)V9(5) VALUE 0.0.
	   01 WS-AREA      PIC 9(8)V9(5) VALUE 0.0.
	   
	   01 WS-DISPLAY-VARS.
	      05 WS-DISPLAY-CIRC PIC ZZ99.99.
	      05 WS-DISPLAY-AREA PIC ZZ99.99.
	   
	   PROCEDURE DIVISION.
	   
	   0100-START.
	   
		  DISPLAY "Please insert circle radius: "
		  ACCEPT WS-RADIUS.
		  
		  MULTIPLY WS-PI-VALUE BY WS-RADIUS GIVING WS-CIRC.
		  MULTIPLY WS-CIRC BY 2 GIVING WS-CIRC.
          MOVE WS-CIRC TO WS-DISPLAY-CIRC.		  
          DISPLAY "Your Circle Circunference is: ", WS-DISPLAY-CIRC.

		  
		  COMPUTE WS-AREA = WS-RADIUS * WS-RADIUS * WS-PI-VALUE.
		  MOVE WS-AREA TO WS-DISPLAY-AREA.
		  DISPLAY "Your Circle Area is: ", WS-DISPLAY-AREA.
		  
		  STOP RUN.
